{
  "what should i feed my puppy?": "Puppies need a balanced diet rich in protein, fat and calcium. Use a high-quality puppy formula. Feed 3–4 times a day until 6 months, then 2–3 times.",
  "how often should i walk my dog?": "Most adult dogs need at least two 20–30 minute walks daily. High-energy breeds may need more.",
  "my dog is vomiting": "Withhold food for 8–12 hours, offer small amounts of water. If vomiting persists >24h, there is blood, lethargy, or pain—contact a vet urgently.",
  "diarrhea in dogs": "Mild cases: rest gut for 12h then bland diet (boiled chicken & rice). See a vet if diarrhea lasts >24–48h, contains blood, or your dog is lethargic/dehydrated.",
  "parvovirus symptoms": "Severe vomiting, bloody diarrhea, fever, lethargy, loss of appetite—urgent vet care required. Vaccination is the best prevention.",
  "ear infection signs": "Head shaking, scratching, odor, redness, dark discharge. Clean only with vet-approved solutions and see a vet for medication.",
  "flea treatment": "Use a vet-approved flea preventive (topical/chewable). Wash bedding, vacuum carpets, and treat the home environment.",
  "weight management": "Use a measured portion of a complete diet, limit treats (<10% of calories), daily exercise. Aim for a visible waist and ribs palpable with light pressure.",
  "dental care": "Daily tooth brushing with dog toothpaste, dental chews, and periodic professional cleaning help prevent periodontal disease.",
  "vaccination schedule": "Puppies: start at 6–8 weeks, boosters every 3–4 weeks until 16 weeks. Adult dogs: boosters per vet guidance (often every 1–3 years).",
  "can dogs eat chocolate?": "No, chocolate is toxic to dogs. It can cause vomiting, seizures, heart problems, and even death. Seek emergency vet care if ingested.",
  "can dogs eat grapes?": "No, grapes and raisins are toxic to dogs. They can cause kidney failure even in small amounts.",
  "can dogs eat onions or garlic?": "No, onions, garlic, leeks, and chives damage red blood cells and cause anemia in dogs.",
  "is peanut butter safe for dogs?": "Yes, plain unsalted peanut butter is safe in moderation. Avoid brands with xylitol—it’s toxic to dogs.",
  "can dogs eat bananas?": "Yes, bananas are safe in moderation. They provide potassium and fiber but should be a treat, not a meal.",
  "can dogs eat apples?": "Yes, apples are safe. Remove seeds and core. They provide vitamins A & C and fiber.",
  "can dogs eat rice?": "Yes, plain cooked rice is safe and often used in bland diets for upset stomachs.",
  "can dogs eat eggs?": "Yes, cooked eggs are safe, high in protein and biotin. Avoid raw eggs due to salmonella risk.",
  "can dogs drink milk?": "Some dogs are lactose intolerant. Small amounts are safe, but diarrhea may occur. Use lactose-free dog milk if needed.",
  "can dogs eat cheese?": "Yes, in moderation. Avoid blue cheese and those high in fat or salt. Some dogs may be lactose intolerant.",
  "can dogs eat bread?": "Plain white or brown bread is safe in moderation but offers little nutritional value. Avoid flavored breads with raisins or garlic.",
  "can dogs eat fish?": "Yes, cooked fish like salmon, cod, and tuna is safe. Avoid raw fish, bones, and fried/seasoned varieties.",
  "can dogs eat chicken bones?": "No, cooked chicken bones can splinter and cause choking or internal injury. Only raw meaty bones under vet guidance are safe.",
  "can dogs eat carrots?": "Yes, raw or cooked carrots are safe, low-calorie treats that improve dental health.",
  "can dogs eat sweet potatoes?": "Yes, cooked sweet potatoes are nutritious and high in fiber and beta-carotene.",
  "can dogs eat watermelon?": "Yes, seedless watermelon is safe. Avoid seeds and rind. It’s hydrating and low in calories.",
  "can dogs eat strawberries?": "Yes, strawberries are safe and full of antioxidants. Feed in moderation.",
  "can dogs eat blueberries?": "Yes, blueberries are safe, rich in antioxidants, fiber, and vitamin C.",
  "can dogs eat cucumber?": "Yes, cucumber is safe and low in calories. Great snack for overweight dogs.",
  "can dogs eat pumpkin?": "Yes, plain cooked pumpkin helps with digestion, diarrhea, and constipation.",
  "can dogs eat potatoes?": "Cooked plain potatoes are safe. Never feed raw or green potatoes—they contain toxic solanine.",
  "can dogs eat corn?": "Yes, plain corn is safe. Avoid cobs—they can cause choking and intestinal blockage.",
  "can dogs eat pork?": "Cooked lean pork is safe in small amounts. Avoid fatty cuts, raw pork, and heavily seasoned pork.",
  "can dogs eat turkey?": "Yes, plain cooked turkey (without bones, skin, or seasoning) is safe.",
  "can dogs eat beef?": "Yes, lean cooked beef is safe and provides protein and essential amino acids.",
  "can dogs eat almonds?": "No, almonds are not safe. They can cause digestive upset and choking.",
  "can dogs eat cashews?": "Yes, unsalted cashews are safe in moderation. High in fat, so avoid overfeeding.",
  "can dogs eat pistachios?": "No, pistachios are unsafe. High fat content may cause pancreatitis and stomach upset.",
  "can dogs eat macadamia nuts?": "No, macadamia nuts are highly toxic to dogs. They cause weakness, vomiting, tremors, and hyperthermia.",
  "can dogs eat peanuts?": "Yes, plain unsalted peanuts are safe in moderation. Avoid salted and flavored varieties.",
  "can dogs eat honey?": "Yes, raw honey is safe for adult dogs. Avoid giving to puppies under 1 year due to botulism risk.",
  "can dogs eat ice cream?": "Not recommended. Most dogs are lactose intolerant and ice cream is high in sugar. Special dog ice creams are safer.",
  "can dogs eat coconut?": "Yes, coconut meat and oil are safe in moderation. Avoid coconut shell—it can cause choking.",
  "can dogs eat oats?": "Yes, plain cooked oats are safe and provide fiber. Avoid flavored or sweetened oats.",
  "can dogs eat peas?": "Yes, peas are safe and nutritious. Avoid canned peas with added salt.",
  "can dogs eat broccoli?": "Yes, small amounts of broccoli are safe. Large amounts may cause gas and stomach upset.",
  "can dogs eat spinach?": "Yes, in moderation. High in oxalic acid which can affect kidneys if fed excessively.",
  "can dogs eat lettuce?": "Yes, lettuce is safe but low in nutrients. It can be given as a crunchy snack.",
  "can dogs eat cabbage?": "Yes, in small amounts. Can cause gas if overfed.",
  "can dogs eat mango?": "Yes, mango is safe. Remove skin and pit before feeding.",
  "can dogs eat pears?": "Yes, pears are safe. Remove seeds and core to avoid cyanide poisoning.",
  "can dogs eat oranges?": "Yes, oranges are safe in small amounts. Some dogs dislike the acidity.",
  "can dogs eat pineapple?": "Yes, pineapple is safe. Remove skin and core before feeding.",
  "can dogs eat raspberries?": "Yes, safe in moderation. Contain small amounts of natural xylitol—so avoid overfeeding.",
  "can dogs eat plums?": "No, plums are unsafe. The pits contain cyanide and can cause choking.",
  "can dogs eat cherries?": "No, cherry pits and stems contain cyanide. Flesh is safe but risky overall.",
  "can dogs eat kiwi?": "Yes, kiwi is safe in small pieces. Remove skin and seeds.",
  "can dogs eat papaya?": "Yes, papaya is safe. Remove seeds and skin.",
  "can dogs eat cranberries?": "Yes, safe in moderation. Too much can cause stomach upset.",
  "can dogs eat zucchini?": "Yes, zucchini is safe, low-calorie, and nutritious.",
  "can dogs eat bell peppers?": "Yes, bell peppers are safe, especially red ones. Avoid spicy peppers.",
  "can dogs eat avocado?": "No, avocado contains persin, which is toxic to dogs.",
  "can dogs eat mushrooms?": "Only store-bought mushrooms are safe. Wild mushrooms can be toxic and deadly.",
  "can dogs eat celery?": "Yes, celery is safe and can help freshen breath.",
  "can dogs eat beets?": "Yes, cooked beets are safe and provide fiber and vitamins.",
  "can dogs eat green beans?": "Yes, green beans are safe, low-calorie, and filling for overweight dogs.",
  "can dogs eat jalapenos?": "No, spicy foods like jalapeños cause stomach upset and discomfort.",
  "can dogs eat pickles?": "Not recommended due to high salt and vinegar content.",
  "can dogs eat sausage?": "Not recommended. Sausages are high in fat, salt, and spices.",
  "can dogs eat bacon?": "No, bacon is too fatty and salty. Can cause pancreatitis.",
  "can dogs eat hot dogs?": "Not recommended. Highly processed with salt and preservatives.",
  "can dogs eat liver?": "Yes, in moderation. High in vitamin A—too much can cause toxicity.",
  "can dogs eat hearts or gizzards?": "Yes, organ meats like hearts and gizzards are safe and nutritious in moderation.",
  "can dogs eat raw meat?": "Not recommended without vet guidance. Risk of salmonella and parasites.",
  "can dogs eat cooked bones?": "No, cooked bones splinter and can cause injury.",
  "can dogs eat raw bones?": "Raw bones may be safe under vet supervision, but risk of dental fractures and infection exists.",
  "can dogs eat dog biscuits daily?": "Yes, but treats should be <10% of daily calories.",
  "how much water should my dog drink?": "Dogs should drink ~50–70 ml of water per kg of body weight daily. More in hot weather or with exercise.",
  "how many calories does a dog need daily?": "Calorie needs depend on size, age, breed, and activity. A 10kg dog needs ~400 calories/day. Ask a vet for precise needs.",
  "how do i know if my dog is overweight?": "Ribs should be felt but not seen, waist visible from above, abdomen tucked from the side. Overweight dogs lack these features.",
  "how do i help my dog lose weight?": "Reduce calories, increase exercise, use measured portions. Consult vet for a safe weight-loss plan.",
  "how do i help my underweight dog gain weight?": "Feed calorie-dense food, add healthy fats (salmon oil), and feed multiple meals daily. Rule out medical causes.",
  "how often should i groom my dog?": "Depends on breed. Short-haired: every few weeks. Long-haired: weekly. Some breeds need professional grooming.",
  "how often should i bathe my dog?": "Every 4–6 weeks, unless dirty. Over-bathing strips oils and irritates skin.",
  "how do i trim my dog’s nails?": "Use dog nail clippers, trim small amounts at a time to avoid cutting the quick. If unsure, ask a groomer or vet.",
  "how do i clean my dog’s ears?": "Use vet-approved ear cleaner and cotton balls. Never insert deep swabs. See vet if infection signs appear.",
  "how do i brush my dog’s teeth?": "Use dog toothbrush and toothpaste. Brush daily if possible. Never use human toothpaste.",
  "how much exercise does a puppy need?": "5 minutes per month of age, twice daily (e.g., 20 mins for 4-month-old). Avoid over-exercising young puppies.",
  "how much exercise does an adult dog need?": "Most adult dogs need 30–60 minutes daily. High-energy breeds may require 2+ hours.",
  "how much exercise does a senior dog need?": "Gentle daily walks (20–40 minutes) and light play. Adjust based on health and mobility.",
  "is swimming good for dogs?": "Yes, swimming is excellent low-impact exercise for dogs with joint issues.",
  "can i run with my dog?": "Yes, but only after they are fully grown. Start gradually and bring water.",
  "can i bike with my dog?": "Yes, high-energy breeds may enjoy it. Use a proper leash attachment and avoid hot surfaces.",
  "what indoor exercises are good for dogs?": "Tug-of-war, fetch, puzzle toys, hide and seek, stair climbs.",
  "what mental stimulation do dogs need?": "Puzzle feeders, training games, scent work, new environments.",
  "can dogs do yoga with me?": "Yes, dog yoga (doga) involves stretching, massage, and bonding activities.",
  "can dogs get sore muscles from exercise?": "Yes, especially if over-exercised. Gradually increase intensity.",
  "is fetch good exercise for dogs?": "Yes, but avoid excessive high-impact fetch on hard surfaces.",
  "is tug-of-war safe for dogs?": "Yes, with rules. Teach release command and stop if dog gets too aggressive.",
  "can my dog walk in the rain?": "Yes, rain is safe. Dry and warm them afterward to prevent chills.",
  "can my dog walk in snow?": "Yes, but limit exposure. Protect paws with booties. Wipe salt off afterward.",
  "can my dog walk in summer heat?": "Avoid peak heat. Walk early morning or evening. Carry water.",
  "how can i tell if my dog is tired from exercise?": "Signs: heavy panting, slowing down, lying down, refusing to continue.",
  "my dog is coughing a lot": "Persistent coughing can mean kennel cough, heart disease, or lung infection. If it lasts more than 2 days, or if your dog has breathing difficulty, visit a vet.",
  "dog coughing like something stuck in throat": "This may be kennel cough or throat irritation. If gagging or choking continues, seek immediate veterinary attention.",
  "dog has bloody stool": "Bloody stool may indicate parasites, infection, or gastrointestinal bleeding. Urgent veterinary care is recommended.",
  "dog has mucus in stool": "Mucus may suggest colitis or intestinal irritation. Monitor hydration and consult a vet if it persists beyond 1–2 days.",
  "dog is constipated": "Ensure hydration, exercise, and add fiber (pumpkin, veggies). If constipation lasts more than 48h or dog strains in pain, see a vet.",
  "dog has diarrhea and vomiting": "Could be gastroenteritis, food poisoning, or infection. Offer water, bland diet after 12h. If symptoms persist >24h, see a vet urgently.",
  "my dog has a fever": "A dog’s normal temperature is 101–102.5°F. Fever (>103°F) can signal infection or inflammation. Use a rectal thermometer and contact a vet.",
  "dog feels very hot": "Check temperature. Overheating may be heatstroke—move dog to a cool place, offer small water sips, and seek urgent vet help.",
  "my dog collapsed suddenly": "Collapse may be caused by heart problems, low sugar, poisoning, or seizures. This is an emergency—get to a vet immediately.",
  "dog having seizure": "Keep dog safe from injury, do not restrain, note seizure length. If it lasts >5 minutes or repeats, seek emergency veterinary care.",
  "dog has difficulty breathing": "This is an emergency. Causes include allergic reaction, choking, heart or lung disease. Go to a vet immediately.",
  "dog sneezing a lot": "Occasional sneezing is normal. Persistent sneezing may be allergies, nasal mites, or infection. See a vet if discharge or bleeding occurs.",
  "dog has nosebleed": "Causes include trauma, foreign object, infection, or clotting issues. Keep dog calm, apply gentle pressure above nostrils, and see a vet.",
  "dog has runny nose": "Mild clear discharge may be allergies. Yellow/green discharge may signal infection. Vet visit needed if persistent.",
  "dog has swollen face": "Swelling often means allergic reaction or abscess. Seek urgent vet care, especially if breathing is affected.",
  "dog's gums are pale": "Pale gums may indicate anemia, blood loss, or shock. This is an emergency—see a vet immediately.",
  "dog's gums are blue": "Blue gums indicate lack of oxygen. Seek emergency veterinary help.",
  "dog drooling excessively": "May be nausea, dental disease, heatstroke, or toxin ingestion. If sudden and severe, see a vet quickly.",
  "dog has a swollen abdomen": "Could be bloat (life-threatening) or fluid buildup. If abdomen is hard, painful, or dog is restless/vomiting, go to vet immediately.",
  "dog retching but not vomiting": "This is a red flag for bloat (GDV), an emergency condition. Go to a vet right away.",
  "dog limping suddenly": "Could be sprain, fracture, or injury. Rest dog, restrict activity, and see a vet if severe or persistent.",
  "dog has swollen paw": "May be from insect bite, infection, or injury. Clean area and monitor. If swelling worsens or dog is in pain, see a vet.",
  "dog keeps licking paw": "This may indicate allergy, irritation, or foreign object. Inspect paw and consult a vet if persistent.",
  "dog has itchy skin": "Common causes include fleas, allergies, or infection. Use flea control and consult a vet for diagnosis.",
  "dog has bald patches": "Bald spots may result from mange, allergies, or fungal infection. Vet check needed for diagnosis and treatment.",
  "dog has ear discharge": "Brown/black = mites, yellow/green = infection. Clean only with vet-approved solution and seek veterinary care.",
  "dog shaking head a lot": "Often due to ear infection or mites. Vet visit recommended for ear exam.",
  "dog has red eyes": "Redness can be allergies, infection, or glaucoma. If accompanied by pain or vision changes, see a vet urgently.",
  "dog has cloudy eyes": "May signal cataracts, corneal disease, or glaucoma. A vet exam is needed.",
  "dog is squinting": "Squinting often indicates eye pain. Could be injury or infection—urgent vet visit advised.",
  "dog has blood in urine": "May be urinary tract infection, bladder stones, or more serious issues. Vet check required.",
  "dog is peeing frequently": "Frequent urination may signal infection, diabetes, or kidney disease. Schedule a vet exam.",
  "dog straining to pee": "This can mean blockage (especially in males) and is an emergency. See a vet immediately.",
  "dog not drinking water": "Check for dehydration. Causes may include illness, fever, or pain. Encourage water and consult a vet if refusal continues.",
  "dog drinking too much water": "Excessive thirst may indicate diabetes, kidney, or liver disease. Schedule a vet exam.",
  "dog is refusing food": "Could be dental pain, illness, or infection. If refusal lasts more than 24h, consult a vet.",
  "dog has sudden weight loss": "Unexplained weight loss may indicate parasites, cancer, or chronic illness. Vet evaluation needed.",
  "dog is overweight": "Switch to portion control, increase exercise, use low-calorie treats. Seek vet guidance for safe weight loss.",
  "dog has swollen lymph nodes": "Can indicate infection or cancer. Vet evaluation needed.",
  "dog has lumps under skin": "Not all lumps are cancer, but all should be checked by a vet. Fine needle aspiration can diagnose.",
  "dog has hot spot": "Hot spots are painful skin infections. Clip hair, clean gently, prevent licking, and see vet for medication.",
  "dog has dandruff": "Mild dandruff may be dry skin. Persistent cases may indicate allergies, parasites, or poor nutrition. Vet check recommended.",
  "dog's nails are bleeding": "Apply styptic powder or cornstarch with pressure. If bleeding continues >10 minutes, see a vet.",
  "dog cut paw pad": "Clean with saline, bandage lightly, and prevent licking. Vet care if deep or bleeding heavily.",
  "dog bitten by another dog": "Clean wound, control bleeding, and see a vet for antibiotics. Dog bites often cause infections.",
  "dog stung by bee": "Remove stinger, apply cold compress. Give vet-approved antihistamine. Watch for allergic reaction (swelling, difficulty breathing).",
  "dog has tick": "Remove carefully with tweezers, pulling straight out. Clean area and monitor for infection or Lyme disease signs.",
  "dog has fleas": "Use vet-approved flea prevention. Wash bedding and vacuum home thoroughly.",
  "dog has worms": "Worms may appear in stool. Deworm with vet-prescribed medication and maintain regular deworming schedule.",
  "dog was poisoned": "Signs include drooling, vomiting, tremors, seizures. Call vet or poison helpline immediately. Bring packaging if known.",
  "dog ate chocolate": "Chocolate is toxic, especially dark/baking chocolate. Call vet immediately with dog’s weight and amount ingested.",
  "dog ate grapes or raisins": "These can cause kidney failure. Contact vet immediately.",
  "dog ate xylitol": "Xylitol (in sugar-free gum) causes dangerous low blood sugar. Emergency vet care needed.",
  "dog ate onions or garlic": "Both are toxic to dogs and cause anemia. Contact vet urgently.",
  "dog ate bones": "Cooked bones can splinter and injure intestines. Monitor closely and see a vet if vomiting, pain, or constipation occurs.",
  "dog ate socks": "Foreign bodies can cause blockage. If vomiting or not eating, go to vet urgently.",
  "dog ate rat poison": "This is life-threatening. Immediate vet treatment with antidote is critical.",
  "dog has motion sickness": "Feed small meal 3h before travel, keep car cool. Vet can prescribe anti-nausea medication.",
  "dog overheated": "Move to shade, wet with cool (not cold) water, and use fan. Get vet care if dog is weak, drooling, or collapsing.",
  "dog hypothermia": "Warm with blankets, warm water bottles. Avoid direct heat. Vet care required if severe.",
  "dog frostbite": "Warm affected area gradually with lukewarm water. Do not rub. Seek vet care.",
  "dog has arthritis": "Provide joint supplements, soft bedding, weight control, and gentle exercise. Vet may prescribe pain medication.",
  "dog has hip dysplasia": "Manage with weight control, exercise, and joint supplements. Severe cases may need surgery.",
  "dog has luxating patella": "Common in small breeds. Mild cases managed with exercise and weight control. Severe cases may need surgery.",
  "dog has heart murmur": "Requires monitoring. Some dogs remain stable, others develop heart disease. Vet exams and medication may be needed.",
  "dog has congestive heart failure": "Signs include coughing, breathing difficulty, fatigue. Requires lifelong vet treatment with medication.",
  "dog has diabetes": "Signs include excessive thirst, urination, weight loss. Managed with insulin, diet, and monitoring. Vet care essential.",
  "dog has kidney disease": "Symptoms: drinking/urinating more, weight loss, vomiting. Managed with special diet and vet care.",
  "dog has liver disease": "Signs: jaundice (yellow gums/eyes), vomiting, lethargy. Vet tests and treatment needed.",
  "dog has pancreatitis": "Symptoms: vomiting, painful belly, lethargy. Requires vet treatment, low-fat diet, and monitoring.",
  "dog has anemia": "Symptoms: pale gums, weakness, rapid heartbeat. May be caused by parasites, blood loss, or disease. Vet diagnosis required.",
  "dog has cancer": "Signs include lumps, weight loss, bleeding, lethargy. Vet check and biopsy required for diagnosis.",
  "dog has cushings disease": "Signs: increased thirst, urination, panting, hair loss, pot belly. Diagnosis and treatment by vet needed.",
  "dog has addisons disease": "Symptoms: vomiting, diarrhea, weakness, collapse. Can be life-threatening. Vet diagnosis and treatment required.",
  "dog has hypothyroidism": "Signs: weight gain, lethargy, hair loss, skin infections. Treated with thyroid medication.",
  "dog has hyperthyroidism": "Rare in dogs. Signs: weight loss, hyperactivity. Vet evaluation required.",
  "dog has kennel cough": "Dry hacking cough, often after boarding. Usually mild, but vet exam ensures proper care.",
  "dog has parvovirus": "Symptoms: vomiting, bloody diarrhea, fever, lethargy. This is an emergency, see a vet immediately.",
  "dog has distemper": "Signs include fever, discharge, coughing, seizures. Fatal without vaccination. Urgent vet care needed.",
  "dog has rabies symptoms": "Aggression, foaming, paralysis, seizures. Rabies is fatal. Isolate and call animal control immediately.",
  "dog has leptospirosis": "Signs: fever, vomiting, jaundice, kidney/liver issues. Zoonotic (spread to humans). Vet care urgent.",
  "dog has lyme disease": "Signs: fever, lameness, swollen joints. Tick prevention is key. Vet antibiotics may be needed.",
  "dog has mange": "Causes hair loss, itching, crusty skin. Needs vet-prescribed treatment.",
  "dog has ringworm": "Fungal infection causing circular bald patches. Contagious to humans. Vet antifungal treatment required.",
  "dog has ear mites": "Cause intense itching, dark discharge. Vet cleaning and medication required.",
  "dog has worms in vomit": "Indicates parasite infestation. Vet deworming required.",
  "dog has anemia after ticks": "May be tick-borne disease like ehrlichia or babesiosis. Vet testing needed.",
  "dog has allergies": "Signs: itching, licking, ear infections. May be food or environmental. Vet can run allergy tests and prescribe treatment.",
  "dog has food allergy": "Common allergens: chicken, beef, dairy, grains. Try elimination diet with novel protein. Vet guidance recommended.",
  "dog has environmental allergies": "Triggered by pollen, dust, mold. Signs: itching, sneezing, watery eyes. Vet can prescribe medication or immunotherapy.",
  "dog has yeast infection": "Signs: itchy, smelly skin, greasy fur. Vet antifungal treatment needed.",
  "dog has bladder stones": "Cause straining, blood in urine. Require vet diagnosis and treatment (diet or surgery).",
  "dog has prostate problem": "Signs: difficulty urinating, straining, blood. Vet check needed, common in unneutered males.",
  "dog has anal gland issue": "Scooting, licking rear, foul smell. Vet can express glands or treat infection.",
  "dog anal gland abscess": "Painful swelling near anus, may burst. Needs vet drainage and antibiotics.",
  "dog has broken tooth": "May cause pain, drooling, refusal to eat. Vet dental care needed.",
  "dog has periodontal disease": "Signs: bad breath, tartar, gum bleeding. Prevent with brushing and vet dental cleaning.",
  "dog ingested foreign object": "Signs: vomiting, no appetite, abdominal pain. Emergency vet surgery may be required.",
  "what vaccines does my dog need?": "Core vaccines include rabies, distemper, parvovirus, adenovirus. Non-core like bordetella, leptospirosis, and Lyme depend on lifestyle and region.",
  "when should my puppy get first vaccines?": "At 6–8 weeks, then boosters every 3–4 weeks until 16 weeks. Rabies at 12–16 weeks depending on law.",
  "do adult dogs need booster shots?": "Yes, usually every 1–3 years depending on the vaccine and your vet’s advice.",
  "is rabies vaccine mandatory?": "Yes, in most regions it’s legally required and protects both dogs and humans.",
  "can my dog get sick after vaccines?": "Mild soreness or sleepiness is normal. Rarely, allergic reactions may occur—contact a vet if severe swelling, vomiting, or breathing issues.",
  "what is bordetella vaccine?": "It protects against kennel cough, recommended if your dog goes to daycare, grooming, or boarding.",
  "does my dog need leptospirosis vaccine?": "Yes, if you live in or travel to areas with standing water, rodents, or wildlife exposure.",
  "does my dog need flu vaccine?": "Canine influenza vaccines are optional but advised in outbreak-prone areas or for social dogs.",
  "can older dogs get vaccines?": "Yes, healthy seniors should continue boosters. Your vet may adjust schedule depending on health.",
  "what is Lyme disease vaccine?": "Protects against tick-borne Lyme disease, recommended in high-risk areas.",
  "what are side effects of vaccines?": "Common: mild swelling, fever, low energy. Severe reactions are rare but need urgent vet attention.",
  "are vaccine titers reliable?": "Titers can measure protection for distemper, parvo, and adenovirus, but not rabies (law still requires vaccine).",
  "how to prepare dog for vaccination?": "Bring them calm and healthy. Avoid vaccinating if sick, and give small meal before appointment.",
  "can dogs be vaccinated while pregnant?": "Generally avoided unless urgent. Always consult your vet first.",
  "should indoor dogs be vaccinated?": "Yes, many diseases spread without outdoor exposure, and rabies is required by law.",
  "can vaccines cause behavior changes?": "Some dogs may feel tired or irritable briefly. Lasting behavior changes are extremely rare.",
  "is deworming part of preventive care?": "Yes, puppies need frequent deworming, adults need regular prevention against roundworms, hookworms, tapeworms, and whipworms.",
  "how often to deworm my dog?": "Puppies every 2 weeks until 12 weeks old, then monthly. Adults usually every 3 months, or per vet’s advice.",
  "does my dog need flea/tick prevention year-round?": "Yes, in most climates fleas/ticks are active year-round. In colder regions, your vet may adjust schedule.",
  "can heartworm be prevented?": "Yes, monthly oral or topical preventives or yearly injections protect against deadly heartworm disease.",
  "what if I miss a heartworm pill?": "Give it as soon as you remember, but if more than a month late, consult your vet before restarting.",
  "do indoor dogs need heartworm prevention?": "Yes, mosquitoes can enter homes and transmit heartworm.",
  "what happens if my dog isn’t vaccinated?": "They’re at higher risk of deadly diseases and may be denied entry to boarding/daycare/travel.",
  "do vaccines guarantee 100% protection?": "No, but they greatly reduce risk and severity of disease.",
  "can I give my dog vaccines at home?": "Some non-core vaccines can be bought, but rabies and most vaccines must legally be given by a vet.",
  "do small breeds need fewer vaccines?": "No, vaccine type is based on disease risk, not size. Dosages are standardized for immune protection.",
  "can vaccines cause cancer?": "No evidence in dogs. Very rare injection-site tumors occur mostly in cats.",
  "how to keep track of vaccinations?": "Ask your vet for a vaccine certificate or pet health passport.",
  "are there combination vaccines?": "Yes, many vets give DHPP (distemper, hepatitis, parvo, parainfluenza) in one shot.",
  "what is DHPP vaccine?": "A core vaccine protecting against four serious viral diseases.",
  "do dogs need annual rabies shots?": "Depends on local law—some regions require yearly, others every 3 years.",
  "what if my dog has an allergic reaction to a vaccine?": "Tell your vet. They may give pre-medication or adjust the schedule in future.",
  "can sick dogs get vaccines?": "Vaccination should be postponed until recovery, except in urgent rabies risk situations.",
  "can vaccines cause fever?": "Yes, mild fever is a normal short-term immune response.",
  "can dogs get COVID-19 vaccine?": "No, dogs don’t need COVID-19 vaccines. Standard canine vaccines are different.",
  "do working/farm dogs need extra vaccines?": "Yes, leptospirosis and rabies are especially important due to wildlife exposure.",
  "do travel dogs need extra vaccines?": "Yes, check requirements for the country you’re visiting (rabies certificate, bordetella, etc.).",
  "can vaccines fail?": "Rarely, due to poor immune response or improper storage/handling of vaccine.",
  "should senior dogs still get vaccines?": "Yes, unless your vet advises against due to frailty or illness.",
  "how often should I groom my dog?": "Depends on breed—long-haired dogs may need brushing daily, short-haired weekly. Professional grooming every 4–8 weeks for many breeds.",
  "how to brush my dog’s teeth?": "Use dog-specific toothbrush and toothpaste. Start slowly, brush in small circles a few times a week, ideally daily.",
  "do dogs need baths?": "Yes, usually every 4–6 weeks. More often for oily/dirty coats, less often for water-repellent breeds.",
  "can I use human shampoo on my dog?": "No, it disrupts skin pH. Use a dog-formulated shampoo.",
  "how to reduce dog shedding?": "Regular brushing, proper diet with omega-3s, and seasonal grooming help control shedding.",
  "what is deshedding treatment?": "Professional grooming process removing undercoat hair to reduce shedding.",
  "how to trim my dog’s nails?": "Use a pet nail clipper or grinder, trim gradually to avoid cutting quick. If unsure, ask a groomer or vet.",
  "how often should I cut dog nails?": "Every 3–6 weeks, depending on growth and activity on hard surfaces.",
  "what if I cut my dog’s nail too short?": "Apply styptic powder or cornstarch to stop bleeding.",
  "should dogs’ ears be cleaned?": "Yes, check weekly. Clean gently with vet-approved solution if waxy or dirty.",
  "how to prevent ear infections?": "Keep ears dry, clean after swimming, and monitor for redness or odor.",
  "how to clean dog’s eyes?": "Wipe discharge with damp cotton pad. Persistent tearing may need vet check.",
  "what are tear stains?": "Reddish-brown marks under eyes, common in light-coated dogs. Regular cleaning helps, but check for eye/tear duct issues.",
  "how often should I brush my dog?": "Daily for long coats, weekly for short coats.",
  "best brush for dogs?": "Slicker brush for long-haired, bristle brush for short-haired, undercoat rake for double-coated breeds.",
  "can I shave my dog?": "Generally no—fur protects from sun and temperature changes. Only shave if medically required.",
  "how to remove mats in fur?": "Use detangling spray and comb gently. Severe mats may need professional grooming.",
  "can dogs get dandruff?": "Yes, often due to dry skin, allergies, or poor diet.",
  "how to treat dog dandruff?": "Use moisturizing dog shampoo, omega-3 supplements, and consult vet if persistent.",
  "do dogs need sunscreen?": "Yes, especially light-skinned or short-coated breeds. Use pet-safe sunscreen.",
  "how to brush a puppy’s teeth?": "Start early with finger brushes and flavored dog toothpaste, make it positive and gradual.",
  "do dental chews work?": "Yes, they reduce tartar buildup but don’t replace brushing.",
  "how often should I do professional dental cleaning?": "Most dogs benefit every 1–2 years, depending on breed and dental health.",
  "signs of dental disease in dogs?": "Bad breath, drooling, loose teeth, pawing at mouth, bleeding gums.",
  "can I use human toothpaste for dogs?": "No, it contains fluoride/xylitol which is toxic to dogs.",
  "what are hot spots on dogs?": "Red, moist, irritated patches from licking/scratching. Often due to allergies, fleas, or moisture.",
  "how to treat hot spots?": "Clip fur, clean with antiseptic, and see a vet for medication.",
  "can dogs get skin allergies?": "Yes, common triggers include food, pollen, fleas, and dust.",
  "how to manage skin allergies?": "Flea control, hypoallergenic diet, medicated baths, and vet-prescribed meds.",
  "can I use coconut oil on dog’s skin?": "Yes, in small amounts it can moisturize dry skin, but avoid excessive use.",
  "do dogs need haircuts?": "Yes, breeds like poodles, shih tzus, and doodles need regular trimming.",
  "how often to bathe puppy?": "Every 3–4 weeks unless dirty, using puppy-safe shampoo.",
  "how to keep dog coat shiny?": "Balanced diet, regular grooming, omega-3s, and avoiding harsh shampoos.",
  "what causes itchy skin in dogs?": "Fleas, allergies, dryness, infections, or parasites.",
  "how to soothe itchy skin?": "Medicated baths, flea prevention, omega-3s, and vet check for persistent itching.",
  "do dogs get acne?": "Yes, especially on chin/muzzle. Keep area clean, avoid plastic bowls.",
  "what causes hair loss in dogs?": "Allergies, parasites, infections, hormonal issues. Vet exam needed.",
  "how to prevent ticks on dogs?": "Use vet-approved preventives, check coat daily after walks.",
  "can I brush my dog’s teeth with baking soda?": "No, it can upset stomach. Use only dog toothpaste.",
  "is grooming stressful for dogs?": "It can be at first. Introduce slowly with treats and short sessions.",
  "what causes bad breath in dogs?": "Usually dental disease, but also digestive or metabolic issues.",
  "can I use baby wipes on dogs?": "Occasionally, but pet-specific wipes are safer for skin pH.",
  "are hair dryers safe for dogs?": "Yes, on cool/low setting and at a distance. High heat can burn.",
  "how to clean dog paws after walk?": "Wipe with damp cloth or paw wipes, check for debris between toes.",
  "do dogs need paw balm?": "Yes, in winter or hot summers to prevent cracks and burns.",
  "should I pluck dog ear hair?": "Not usually—modern vets advise trimming not plucking, unless infections occur.",
  "how to prevent mats in curly-coated dogs?": "Daily brushing, detangling sprays, and regular trims.",
  "how to calm dog at groomer?": "Familiarize with handling at home, use positive reinforcement, and consider calming aids if anxious.",
  "what vaccines are essential for puppies?": "Core vaccines: distemper, parvovirus, adenovirus, and rabies. Non-core vaccines depend on risk (kennel cough, leptospirosis, Lyme).",
  "when should I start vaccinating my puppy?": "Puppies usually begin vaccines at 6–8 weeks of age, with boosters every 3–4 weeks until 16 weeks.",
  "how often should my adult dog get vaccinated?": "Most core vaccines are boosted every 1–3 years, depending on local laws and your vet’s recommendations.",
  "do indoor dogs need vaccines?": "Yes, core vaccines are still required to protect against airborne or indirect exposure to viruses.",
  "is rabies vaccination mandatory?": "Yes, in most countries and states rabies vaccination is legally required for all dogs.",
  "can vaccines make my dog sick?": "Mild side effects like soreness, tiredness, or low fever are common. Serious reactions are rare but need urgent vet care.",
  "what is kennel cough vaccine?": "A vaccine against Bordetella bronchiseptica and other respiratory pathogens, recommended if your dog visits kennels, daycare, or grooming salons.",
  "does my dog need leptospirosis vaccine?": "Yes, if your dog is exposed to outdoor water sources, farms, or wildlife areas where leptospira bacteria live.",
  "can senior dogs skip vaccines?": "Not usually. Core vaccines remain important, though vets may adjust the schedule depending on health and lifestyle.",
  "how long does a rabies shot last?": "Depending on the vaccine and local regulations, rabies protection lasts 1–3 years.",
  "do dogs need flu shots?": "In high-risk areas or for social dogs, canine influenza vaccines may be recommended by your vet.",
  "can I vaccinate my dog at home?": "No. Vaccines must be properly stored and administered by trained professionals for safety and validity.",
  "what if I miss a vaccine booster?": "Contact your vet—your dog may need to restart the series to ensure full protection.",
  "do small breeds need fewer vaccines?": "No, all dogs need the same essential vaccines regardless of size.",
  "are titer tests an alternative to vaccines?": "Yes, blood titers can measure immunity levels, but not all vaccines have reliable titer tests.",
  "should pregnant dogs get vaccinated?": "Generally no, except for rabies if required. Vaccines are best given before breeding.",
  "does my dog need deworming along with vaccines?": "Yes, puppies and adults should follow a deworming schedule to reduce parasite risks.",
  "what are heartworm preventives?": "Monthly oral or topical medications protect dogs from deadly heartworm disease spread by mosquitoes.",
  "should I give flea and tick prevention year-round?": "Yes, in most regions flea and tick prevention should be consistent all year.",
  "are natural flea remedies effective?": "Homemade or herbal remedies are not reliable; vet-approved preventives are safest and most effective.",
  "how soon after adoption should I vaccinate a rescue dog?": "As soon as possible—take them to a vet for a checkup and updated vaccines.",
  "can vaccines prevent parvovirus in adults?": "Yes, vaccinated dogs are well protected against parvovirus, though no vaccine is 100% effective.",
  "is distemper still common?": "Yes, outbreaks still occur, especially in unvaccinated dogs.",
  "does my dog need Lyme disease vaccine?": "In high-tick regions, vets may recommend it along with tick prevention.",
  "can multiple vaccines be given in one visit?": "Yes, combination vaccines are common, and vets space doses appropriately for safety.",
  "are booster shots safe for tiny dogs?": "Yes, though vets may split vaccines into separate visits for very small breeds.",
  "what if my dog had a reaction to a vaccine?": "Inform your vet immediately. They may adjust the schedule or use pre-medication for future doses.",
  "can vaccines cure illness?": "No, vaccines prevent illness but do not treat existing diseases.",
  "how much do dog vaccines cost?": "Cost varies by country and clinic but expect $20–50 per vaccine or $100–300 for a full puppy series.",
  "do dogs need tetanus shots?": "No, dogs are highly resistant to tetanus and do not require vaccination.",
  "should dogs be vaccinated before travel?": "Yes, especially rabies and region-specific vaccines. Check destination requirements in advance.",
  "what preventive care do puppies need besides vaccines?": "Regular deworming, flea/tick prevention, microchipping, and spay/neuter when appropriate.",
  "are there vaccine alternatives for allergic dogs?": "Titer testing and modified protocols may be used, but discuss carefully with your vet.",
  "does my dog need vaccination for dog parks?": "Yes, vaccines protect against diseases commonly spread in social environments.",
  "is coronavirus vaccine for dogs necessary?": "Canine coronavirus vaccine is generally not recommended as it offers limited protection.",
  "what is the difference between core and non-core vaccines?": "Core vaccines are essential for all dogs; non-core depend on lifestyle and risk factors.",
  "do boarding facilities require vaccines?": "Yes, most require proof of rabies, distemper, parvovirus, and kennel cough vaccination.",
  "how can I keep track of my dog’s vaccines?": "Use a veterinary health card, app, or reminders to never miss a dose.",
  "are vaccines effective immediately?": "No, it takes 1–2 weeks after vaccination for full protection to develop.",
  "what happens if my unvaccinated dog meets a sick dog?": "They are at high risk of infection—contact your vet for immediate advice.",
  "how often should I bathe my dog?": "Most dogs need a bath every 4–6 weeks, unless dirty or with skin conditions requiring special care.",
  "can frequent bathing harm dogs?": "Yes, overbathing strips natural oils and causes dry, itchy skin. Always use dog shampoo.",
  "what shampoo is best for dogs?": "Use a vet-approved dog shampoo. Avoid human products, which can irritate a dog’s skin.",
  "how can I reduce shedding?": "Regular brushing, a balanced diet, and supplements like omega-3s help minimize excessive shedding.",
  "what type of brush is best for my dog?": "Short coats: bristle brushes. Long coats: slicker brushes. Thick coats: undercoat rake.",
  "should I trim my dog’s nails at home?": "Yes, if comfortable. Trim every 3–4 weeks. If unsure, ask a groomer or vet.",
  "how do I know if my dog’s nails are too long?": "If nails click on the floor or curve sideways, it’s time to trim.",
  "what if I cut the quick in my dog’s nail?": "Apply styptic powder or cornstarch to stop bleeding. Seek vet help if severe.",
  "do dogs need haircuts?": "Yes, some breeds like Poodles, Shih Tzus, and Yorkies require regular grooming.",
  "how often should I brush my dog’s teeth?": "Ideally daily, but at least 3–4 times per week using dog toothpaste.",
  "can dogs use human toothpaste?": "No, human toothpaste is toxic. Always use veterinary dog toothpaste.",
  "are dental chews enough for oral care?": "No, chews help but do not replace brushing and vet dental cleanings.",
  "how often should dogs get professional dental cleaning?": "Most dogs need it once a year; small breeds may need it more often.",
  "what are signs of dental disease in dogs?": "Bad breath, drooling, loose teeth, red gums, or difficulty eating.",
  "can tartar harm my dog’s health?": "Yes, tartar buildup leads to gum disease, infections, and even heart or kidney problems.",
  "what helps with doggy breath?": "Daily brushing, dental chews, and checkups help keep breath fresh.",
  "how often should I check my dog’s ears?": "Weekly for signs of wax, odor, or redness. Clean only with vet-approved solutions.",
  "are cotton swabs safe for dog ears?": "No, they push debris deeper. Use cotton pads or vet cleaners instead.",
  "should I clean my dog’s eyes?": "Yes, gently wipe discharge with a damp cloth or pet-safe wipes.",
  "what causes tear stains in dogs?": "Overactive tear ducts, allergies, or infections. Certain breeds are more prone.",
  "can I shave my double-coated dog?": "No, shaving ruins coat insulation and may cause overheating or skin issues.",
  "how do I keep my dog’s coat shiny?": "Regular brushing, omega-3 supplements, and a balanced diet.",
  "why is my dog’s skin flaky?": "Dry skin, allergies, or parasites may cause flaking. Try moisturizing shampoos and vet checkups.",
  "how do I remove mats from my dog’s fur?": "Use a dematting tool, patience, and gentle brushing. Severe mats may require grooming clippers.",
  "should dogs wear clothes in winter?": "Yes, short-haired or small breeds may benefit from sweaters or jackets in cold weather.",
  "what sunscreen is safe for dogs?": "Use pet-safe sunscreen on exposed skin like the nose and ears.",
  "why does my dog scratch so much?": "Common causes include fleas, allergies, dry skin, or infections. Vet check is best.",
  "how can I prevent flea allergies?": "Regular flea prevention treatments and keeping the home environment clean.",
  "can dogs get dandruff?": "Yes, dandruff may indicate dry skin, allergies, or underlying disease.",
  "how do I treat hot spots on dogs?": "Clean the area, prevent licking, and seek vet care for medication.",
  "are dog wipes safe for daily use?": "Yes, pet-safe wipes are useful for paws, coat, and face cleaning.",
  "do dogs need paw care?": "Yes, trim fur around paws and moisturize pads to prevent cracks.",
  "why do my dog’s paws smell like corn chips?": "Normal bacteria and yeast on paws can cause a ‘Frito smell.’",
  "is shedding seasonal?": "Yes, most dogs shed heavily in spring and fall when coats change.",
  "how can I control dog odor?": "Regular baths, ear cleaning, dental care, and checking for skin infections.",
  "should I brush my dog daily?": "Yes for long-haired breeds; short-haired dogs need brushing 1–2 times weekly.",
  "what are hypoallergenic dog shampoos?": "Shampoos designed for sensitive skin, free from harsh chemicals and perfumes.",
  "can I use baby shampoo on my dog?": "Occasionally in emergencies, but dog shampoo is much safer long-term.",
  "how do groomers calm anxious dogs?": "Using slow introductions, treats, calming sprays, and gentle handling.",
  "should dogs be sedated for grooming?": "Only if extremely anxious or aggressive, and always under vet supervision.",
  "why does my dog lick his paws constantly?": "Possible allergies, skin irritation, or anxiety. Persistent licking requires vet attention.",
  "do all dogs need professional grooming?": "Not all, but long-haired and high-maintenance coats do best with professional grooming.",
  "are home grooming kits effective?": "Yes, with practice. Clippers, brushes, and nail trimmers can be used safely at home.",
  "can diet affect skin and coat health?": "Yes, deficiencies in omega-3, omega-6, or protein can lead to dull coat and dry skin.",
  "what causes bald patches on dogs?": "Parasites, allergies, fungal infections, or hormonal issues. Vet check is needed.",
  "should I pluck hair from my dog’s ears?": "Not unless recommended by your vet, as unnecessary plucking can cause irritation.",
  "how often should I change my dog’s bedding?": "Weekly washing helps prevent odors, fleas, and skin irritation.",
  "do dogs need regular anal gland care?": "Some dogs need their anal glands expressed by a vet or groomer if they become impacted."
}

